app/Controllers/Login.php

    public function index()
    {
        $PasienModel = new ModelPasien();

        $nikOrEmail  = $this->request->getVar('nik_or_email');
        $password = $this->request->getVar('password');

        $user = $PasienModel->where('email', $nikOrEmail)->orWhere('nik', $nikOrEmail)->first();
---
SELECT *
FROM `pasien`
WHERE `email` = '3674040607010011'
OR `nik` = '3674040607010011'
 LIMIT 1