app/Controllers/Pasien.php

SELECT *
FROM `pasien`
WHERE `email` = 'faishalhmg00@gmail.com'
OR `nik` = 'faishalhmg00@gmail.com'
 LIMIT 1
---
    public function show($nikOrEmail = null)
    {
        $PasienModel = new ModelPasien();
        $data = $PasienModel->where('email', $nikOrEmail)->orWhere('nik', $nikOrEmail)->first();