app/Models/ModelPasien.php

    function getNikOrEmail($nikOrEmail)
    {
        $builder = $this->table("pasien");
        $data = $builder->where('email', $nikOrEmail)->orWhere('nik', $nikOrEmail)->first();
---
SELECT *
FROM `pasien`
WHERE `email` = 'faishalhmg00@gmail.com'
OR `nik` = 'faishalhmg00@gmail.com'
 LIMIT 1